app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # Set user attributes and initialize quarters, dice, and points
    @user.quarters = 3
    @user.sides = 6
    @user.overall_points = 0

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"